In [3]:
import pandas as pd
import numpy as np

In [6]:
data = pd.read_csv('Quiz-P2.csv')
data

     Position Sexe     Temps  Dept  Temps_secondes   Age
0           1    M  00:32:23    76          779543  40.0
1           2    M  00:32:40    27          779560  34.0
2           3    M  00:33:15    76          779595  44.0
3           4    M  00:33:23    76          779603  46.0
4           5    M  00:33:29    76          779609  26.0
..        ...  ...       ...   ...             ...   ...
335       336    F  01:08:34    27          781714  41.0
336       337    F  01:08:36    27          781716  48.0
337       338    M  01:09:31    27          781771  24.0
338       339    F  01:09:31    27          781771  25.0
339       340    F  01:10:31    76          781831  41.0

[340 rows x 6 columns]

In [3]:
data.dtypes

Position            int64
Sexe               object
Temps              object
Dept                int64
Temps_secondes      int64
Age               float64
dtype: object

In [22]:
# data['Dept'].value_counts()
data['Dept'].unique()

array([76, 27, 14, 78], dtype=int64)

In [13]:
data.isnull().sum()

Position          0
Sexe              2
Temps             0
Dept              0
Temps_secondes    0
Age               4
dtype: int64

In [23]:
data['Temps_format'] = pd.to_datetime(data['Temps'], errors="coerce")
data.loc[data['Temps_format'].isnull(),:]

C:\Users\jsu23003\AppData\Local\Temp\ipykernel_22136\3981904378.py:1: UserWarning: Could not infer format, so each element will be parsed individually, falling back to `dateutil`. To ensure parsing is consistent and as-expected, please specify a format.
  data['Temps_format'] = pd.to_datetime(data['Temps'], errors="coerce")

,Position,Sexe,Temps,Dept,Temps_secondes,Age,temps_convert,Temps_format
250,251,M,54min47s,27,780887,42.0,NaT,NaT

In [28]:
data.describe()

,Position,Dept,Temps_secondes,Age,temps_convert,Temps_format
count,340.000000,340.000000,340.000000,336.000000,0,339
mean,177.061765,56.991176,780553.123529,42.145833,NaT,2023-10-02 00:49:12.138642944
min,-100.000000,14.000000,779543.000000,18.000000,NaT,2023-10-02 00:32:23
25%,85.750000,27.000000,780200.500000,34.000000,NaT,2023-10-02 00:43:20
50%,170.500000,76.000000,780536.500000,41.500000,NaT,2023-10-02 00:48:56
75%,255.250000,76.000000,780906.500000,49.250000,NaT,2023-10-02 00:55:07
max,2640.000000,78.000000,781831.000000,174.000000,NaT,2023-10-02 01:10:31
std,166.584054,25.059279,514.526264,13.963690,NaN,NaN

In [32]:
data.loc[data.duplicated(keep=False),:]

Empty DataFrame
Columns: [Position, Sexe, Temps, Dept, Temps_secondes, Age, Temps_format]
Index: []

In [33]:
data.describe(include=['O'])

       Sexe     Temps
count   338       340
unique    3       300
top       M  00:50:07
freq    244         3

In [31]:
VALID_SEXE = ['M', 'F']

mask = ~data['Sexe'].isin(VALID_SEXE)
data.loc[mask, 'Sexe']

93       O
109    NaN
167      O
291    NaN
Name: Sexe, dtype: object